# Пользователь вводит число от 1 до 999. Используя операции с числами
# сообщите что введено: цифра, двузначное число или трёхзначное число.
# Для цифры верните её квадрат, например 5 - 25
# Для двузначного числа произведение цифр, например 30 - 0
# Для трёхзначного числа его зеркальное отображение, например 520 - 25
# Если число не из диапазона, запросите новое число
# Откажитесь от магических чисел
# В коде должны быть один input и один print

number = 222

if (number < 10):
    print(number**2)
elif number < 100:
    print(number // 10 * number % 10)
else:
    one_numb = number % 10
    two_numb = (number // 10) % 10
    three_numb = (number // 100) % 10
    print(int(f'{one_numb}{two_numb}{three_numb}'))
